Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1064DAA176.atdf
      <value-group caption="Trigger Source for Conversion of Analog Input AN1 Select bits" name="ADCTRG1__TRGSRC1">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN2 Select" name="ADCTRG1__TRGSRC2">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN3 Select bits" name="ADCTRG1__TRGSRC3">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN4 Select bits" name="ADCTRG2__TRGSRC4">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN5 Select bits" name="ADCTRG2__TRGSRC5">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN6 Select bits" name="ADCTRG2__TRGSRC6">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN7 Select bits" name="ADCTRG2__TRGSRC7">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN8 Select bits" name="ADCTRG3__TRGSRC8">
         <value caption="Reserved" name="" value="0x1f" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Comparator 2 (COUT)" name="" value="0xc" />
         <value caption="Comparator 1 (COUT)" name="" value="0xb" />
         <value caption="OCMP5" name="" value="0xa" />
         <value caption="OCMP3" name="" value="0x9" />
         <value caption="OCMP1" name="" value="0x8" />
         <value caption="TMR5 match" name="" value="0x7" />
         <value caption="TMR3 match" name="" value="0x6" />
         <value caption="TMR1 match" name="" value="0x5" />
         <value caption="INT0 External interrupt" name="" value="0x4" />
         <value caption="STRIG" name="" value="0x3" />
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2" />
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
