Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1064DAA176.atdf
         <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000002" name="TRISC1" />
            <bitfield mask="0x00000004" name="TRISC2" />
            <bitfield mask="0x00000008" name="TRISC3" />
            <bitfield mask="0x00000010" name="TRISC4" />
            <bitfield mask="0x00001000" name="TRISC12" />
            <bitfield mask="0x00008000" name="TRISC15" />
         </register>
         <register caption="" name="TRISD" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISD0" />
            <bitfield mask="0x00000002" name="TRISD1" />
            <bitfield mask="0x00000004" name="TRISD2" />
            <bitfield mask="0x00000008" name="TRISD3" />
            <bitfield mask="0x00000010" name="TRISD4" />
            <bitfield mask="0x00000020" name="TRISD5" />
            <bitfield mask="0x00000040" name="TRISD6" />
            <bitfield mask="0x00000080" name="TRISD7" />
            <bitfield mask="0x00000200" name="TRISD9" />
            <bitfield mask="0x00000400" name="TRISD10" />
            <bitfield mask="0x00000800" name="TRISD11" />
            <bitfield mask="0x00001000" name="TRISD12" />
            <bitfield mask="0x00002000" name="TRISD13" />
            <bitfield mask="0x00004000" name="TRISD14" />
            <bitfield mask="0x00008000" name="TRISD15" />
         </register>
         <register caption="" name="TRISE" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISE0" />
            <bitfield mask="0x00000002" name="TRISE1" />
            <bitfield mask="0x00000004" name="TRISE2" />
            <bitfield mask="0x00000008" name="TRISE3" />
            <bitfield mask="0x00000010" name="TRISE4" />
            <bitfield mask="0x00000020" name="TRISE5" />
            <bitfield mask="0x00000040" name="TRISE6" />
            <bitfield mask="0x00000080" name="TRISE7" />
            <bitfield mask="0x00000100" name="TRISE8" />
            <bitfield mask="0x00000200" name="TRISE9" />
         </register>
         <register caption="" name="TRISF" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISF0" />
            <bitfield mask="0x00000002" name="TRISF1" />
            <bitfield mask="0x00000004" name="TRISF2" />
            <bitfield mask="0x00000008" name="TRISF3" />
            <bitfield mask="0x00000010" name="TRISF4" />
            <bitfield mask="0x00000020" name="TRISF5" />
            <bitfield mask="0x00000100" name="TRISF8" />
            <bitfield mask="0x00001000" name="TRISF12" />
            <bitfield mask="0x00002000" name="TRISF13" />
         </register>
         <register caption="" name="TRISG" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISG0" />
            <bitfield mask="0x00000002" name="TRISG1" />
            <bitfield mask="0x00000040" name="TRISG6" />
            <bitfield mask="0x00000080" name="TRISG7" />
            <bitfield mask="0x00000100" name="TRISG8" />
            <bitfield mask="0x00000200" name="TRISG9" />
            <bitfield mask="0x00001000" name="TRISG12" />
            <bitfield mask="0x00002000" name="TRISG13" />
            <bitfield mask="0x00004000" name="TRISG14" />
            <bitfield mask="0x00008000" name="TRISG15" />
         </register>
         <register caption="" name="TRISH" offset="0x710" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISH0" />
            <bitfield mask="0x00000002" name="TRISH1" />
            <bitfield mask="0x00000004" name="TRISH2" />
            <bitfield mask="0x00000008" name="TRISH3" />
            <bitfield mask="0x00000010" name="TRISH4" />
            <bitfield mask="0x00000020" name="TRISH5" />
            <bitfield mask="0x00000040" name="TRISH6" />
            <bitfield mask="0x00000080" name="TRISH7" />
            <bitfield mask="0x00000100" name="TRISH8" />
            <bitfield mask="0x00000200" name="TRISH9" />
            <bitfield mask="0x00000400" name="TRISH10" />
            <bitfield mask="0x00000800" name="TRISH11" />
            <bitfield mask="0x00001000" name="TRISH12" />
            <bitfield mask="0x00002000" name="TRISH13" />
            <bitfield mask="0x00004000" name="TRISH14" />
            <bitfield mask="0x00008000" name="TRISH15" />
         </register>
         <register caption="" name="TRISJ" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISJ0" />
            <bitfield mask="0x00000002" name="TRISJ1" />
            <bitfield mask="0x00000004" name="TRISJ2" />
            <bitfield mask="0x00000008" name="TRISJ3" />
            <bitfield mask="0x00000010" name="TRISJ4" />
            <bitfield mask="0x00000020" name="TRISJ5" />
            <bitfield mask="0x00000040" name="TRISJ6" />
            <bitfield mask="0x00000080" name="TRISJ7" />
            <bitfield mask="0x00000100" name="TRISJ8" />
            <bitfield mask="0x00000200" name="TRISJ9" />
            <bitfield mask="0x00000400" name="TRISJ10" />
            <bitfield mask="0x00000800" name="TRISJ11" />
            <bitfield mask="0x00001000" name="TRISJ12" />
            <bitfield mask="0x00002000" name="TRISJ13" />
            <bitfield mask="0x00004000" name="TRISJ14" />
            <bitfield mask="0x00008000" name="TRISJ15" />
         </register>
         <register caption="" name="TRISK" offset="0x910" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISK0" />
            <bitfield mask="0x00000002" name="TRISK1" />
            <bitfield mask="0x00000004" name="TRISK2" />
            <bitfield mask="0x00000008" name="TRISK3" />
            <bitfield mask="0x00000010" name="TRISK4" />
            <bitfield mask="0x00000020" name="TRISK5" />
            <bitfield mask="0x00000040" name="TRISK6" />
            <bitfield mask="0x00000080" name="TRISK7" />
         </register>
